MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64MC706A/mcu.h
#define _FLTBCON_FBEN4_POSITION                  0x00000003
#define _FLTBCON_FBEN4_MASK                      0x00000008
#define _FLTBCON_FBEN4_LENGTH                    0x00000001

#define _FLTBCON_FLTBM_POSITION                  0x00000007
#define _FLTBCON_FLTBM_MASK                      0x00000080
#define _FLTBCON_FLTBM_LENGTH                    0x00000001

#define _FLTBCON_FBOV1L_POSITION                 0x00000008
#define _FLTBCON_FBOV1L_MASK                     0x00000100
#define _FLTBCON_FBOV1L_LENGTH                   0x00000001

#define _FLTBCON_FBOV1H_POSITION                 0x00000009
#define _FLTBCON_FBOV1H_MASK                     0x00000200
#define _FLTBCON_FBOV1H_LENGTH                   0x00000001

#define _FLTBCON_FBOV2L_POSITION                 0x0000000A
#define _FLTBCON_FBOV2L_MASK                     0x00000400
#define _FLTBCON_FBOV2L_LENGTH                   0x00000001

#define _FLTBCON_FBOV2H_POSITION                 0x0000000B
#define _FLTBCON_FBOV2H_MASK                     0x00000800
#define _FLTBCON_FBOV2H_LENGTH                   0x00000001

#define _FLTBCON_FBOV3L_POSITION                 0x0000000C
#define _FLTBCON_FBOV3L_MASK                     0x00001000
#define _FLTBCON_FBOV3L_LENGTH                   0x00000001

#define _FLTBCON_FBOV3H_POSITION                 0x0000000D
#define _FLTBCON_FBOV3H_MASK                     0x00002000
#define _FLTBCON_FBOV3H_LENGTH                   0x00000001

#define _FLTBCON_FBOV4L_POSITION                 0x0000000E
#define _FLTBCON_FBOV4L_MASK                     0x00004000
#define _FLTBCON_FBOV4L_LENGTH                   0x00000001

#define _FLTBCON_FBOV4H_POSITION                 0x0000000F
#define _FLTBCON_FBOV4H_MASK                     0x00008000
#define _FLTBCON_FBOV4H_LENGTH                   0x00000001

#define _P1FLTBCON_FBEN1_POSITION                0x00000000
#define _P1FLTBCON_FBEN1_MASK                    0x00000001
#define _P1FLTBCON_FBEN1_LENGTH                  0x00000001

#define _P1FLTBCON_FBEN2_POSITION                0x00000001
#define _P1FLTBCON_FBEN2_MASK                    0x00000002
#define _P1FLTBCON_FBEN2_LENGTH                  0x00000001

#define _P1FLTBCON_FBEN3_POSITION                0x00000002
#define _P1FLTBCON_FBEN3_MASK                    0x00000004
#define _P1FLTBCON_FBEN3_LENGTH                  0x00000001

#define _P1FLTBCON_FBEN4_POSITION                0x00000003
#define _P1FLTBCON_FBEN4_MASK                    0x00000008
#define _P1FLTBCON_FBEN4_LENGTH                  0x00000001

#define _P1FLTBCON_FLTBM_POSITION                0x00000007
#define _P1FLTBCON_FLTBM_MASK                    0x00000080
#define _P1FLTBCON_FLTBM_LENGTH                  0x00000001

#define _P1FLTBCON_FBOV1L_POSITION               0x00000008
#define _P1FLTBCON_FBOV1L_MASK                   0x00000100
#define _P1FLTBCON_FBOV1L_LENGTH                 0x00000001

#define _P1FLTBCON_FBOV1H_POSITION               0x00000009
#define _P1FLTBCON_FBOV1H_MASK                   0x00000200
#define _P1FLTBCON_FBOV1H_LENGTH                 0x00000001

#define _P1FLTBCON_FBOV2L_POSITION               0x0000000A
#define _P1FLTBCON_FBOV2L_MASK                   0x00000400
#define _P1FLTBCON_FBOV2L_LENGTH                 0x00000001

#define _P1FLTBCON_FBOV2H_POSITION               0x0000000B
#define _P1FLTBCON_FBOV2H_MASK                   0x00000800
#define _P1FLTBCON_FBOV2H_LENGTH                 0x00000001

#define _P1FLTBCON_FBOV3L_POSITION               0x0000000C
#define _P1FLTBCON_FBOV3L_MASK                   0x00001000
#define _P1FLTBCON_FBOV3L_LENGTH                 0x00000001

#define _P1FLTBCON_FBOV3H_POSITION               0x0000000D
#define _P1FLTBCON_FBOV3H_MASK                   0x00002000
#define _P1FLTBCON_FBOV3H_LENGTH                 0x00000001

#define _P1FLTBCON_FBOV4L_POSITION               0x0000000E
#define _P1FLTBCON_FBOV4L_MASK                   0x00004000
#define _P1FLTBCON_FBOV4L_LENGTH                 0x00000001

#define _P1FLTBCON_FBOV4H_POSITION               0x0000000F
#define _P1FLTBCON_FBOV4H_MASK                   0x00008000
#define _P1FLTBCON_FBOV4H_LENGTH                 0x00000001

#define _OVDCON_POUT1L_POSITION                  0x00000000
#define _OVDCON_POUT1L_MASK                      0x00000001
#define _OVDCON_POUT1L_LENGTH                    0x00000001

#define _OVDCON_POUT1H_POSITION                  0x00000001
#define _OVDCON_POUT1H_MASK                      0x00000002
#define _OVDCON_POUT1H_LENGTH                    0x00000001

#define _OVDCON_POUT2L_POSITION                  0x00000002
#define _OVDCON_POUT2L_MASK                      0x00000004
#define _OVDCON_POUT2L_LENGTH                    0x00000001

#define _OVDCON_POUT2H_POSITION                  0x00000003
#define _OVDCON_POUT2H_MASK                      0x00000008
#define _OVDCON_POUT2H_LENGTH                    0x00000001

#define _OVDCON_POUT3L_POSITION                  0x00000004
#define _OVDCON_POUT3L_MASK                      0x00000010
#define _OVDCON_POUT3L_LENGTH                    0x00000001

#define _OVDCON_POUT3H_POSITION                  0x00000005
#define _OVDCON_POUT3H_MASK                      0x00000020
#define _OVDCON_POUT3H_LENGTH                    0x00000001

#define _OVDCON_POUT4L_POSITION                  0x00000006
#define _OVDCON_POUT4L_MASK                      0x00000040
#define _OVDCON_POUT4L_LENGTH                    0x00000001

#define _OVDCON_POUT4H_POSITION                  0x00000007
#define _OVDCON_POUT4H_MASK                      0x00000080
#define _OVDCON_POUT4H_LENGTH                    0x00000001

#define _OVDCON_POVD1L_POSITION                  0x00000008
#define _OVDCON_POVD1L_MASK                      0x00000100
#define _OVDCON_POVD1L_LENGTH                    0x00000001

#define _OVDCON_POVD1H_POSITION                  0x00000009
#define _OVDCON_POVD1H_MASK                      0x00000200
#define _OVDCON_POVD1H_LENGTH                    0x00000001

#define _OVDCON_POVD2L_POSITION                  0x0000000A
#define _OVDCON_POVD2L_MASK                      0x00000400
#define _OVDCON_POVD2L_LENGTH                    0x00000001

#define _OVDCON_POVD2H_POSITION                  0x0000000B
#define _OVDCON_POVD2H_MASK                      0x00000800
#define _OVDCON_POVD2H_LENGTH                    0x00000001

#define _OVDCON_POVD3L_POSITION                  0x0000000C
#define _OVDCON_POVD3L_MASK                      0x00001000
#define _OVDCON_POVD3L_LENGTH                    0x00000001

#define _OVDCON_POVD3H_POSITION                  0x0000000D
#define _OVDCON_POVD3H_MASK                      0x00002000
#define _OVDCON_POVD3H_LENGTH                    0x00000001

